#include <stdio.h>
#include <stdlib.h>
#include "InterfaceTree.h"
#include "quanbao.h"
#include "datebase.h"
int main()
{
    Tree *interface,*now;
    int nextStep;
    interface=Creatmenu();
    now=interface;
    denglu();
    LoadDatabase();
 //   en();
 //   Save(DATEBASE);
    while(1)
    {
        nextStep=translat(now->data);
        Link(&now,nextStep);
    }
    return 0;
}

void en()
{
EnDate(3115007399,"曾健","物理与光电工程学院",14,"电子",2,"1996.9","广州");
EnDate(3115007398,"曾朝伟","物理与光电工程学院",15,"光电",4,"1996.9","广州");
EnDate(3115007401,"张权宝","物理与光电工程学院",16,"电子",3,"1997.11","梅州");
EnDate(3215007407,"张晓明","物理与光电工程学院",14,"光电",1,"1996.10","厦门");
EnDate(3215007333,"梁朝伟","物理与光电工程学院",15,"光电",1,"1996.10","中山");

EnDate(3115007400,"曾立然","机电工程学院",14,"机器人",2,"1995.9","深圳");
EnDate(3115007409,"余文乐","机电工程学院",15,"汽车工程",4,"1995.11","梅州");
EnDate(3114001234,"陈冠希","机电工程学院",16,"工业工程",3,"1997.5","肇庆");
EnDate(3116007303,"欧阳靖","机电工程学院",15,"机械设计",1,"1996.11","上海");
EnDate(3114007889,"张国荣","机电工程学院",14,"机械设计",1,"1995.11","北京");

EnDate(3215007405,"陈淑娴","轻工化工学院",16,"应用化学",2,"1997.9","增城");
EnDate(3115001234,"钱多","轻工化工学院",16,"化学工程",4,"1998.10","深圳");
EnDate(3115001234,"杨幂","轻工化工学院",14,"生物工程",3,"1995.10","深圳");
EnDate(3116008990,"张曼玉","轻工化工学院",16,"应用化学",1,"1998.11","上海");
EnDate(3114005674,"王祖贤","轻工化工程学院",14,"生物工程",1,"1995.8","深圳");
EnDate(3115003456,"周润发","轻工化工院",15,"化学工程",4,"1997.11","广州");

EnDate(3215007777,"邓惜芳","信息工程学院",15,"应用电子技术系",1,"1996.8","肇庆");
EnDate(3216001000,"刘德华","信息工程学院",16,"测控技术系",2,"1997.8","珠海");
EnDate(3214008888,"张学友","信息工程学院",14,"通信工程系",3,"1995.10","肇庆");
EnDate(3215007111,"黎明","信息工程学院",15,"应用电子技术系",4,"1997.8","深圳");
EnDate(3216007111,"郭富城","信息工程学院",16,"测控技术系",4,"1997.8","深圳");

EnDate(3115007341,"张三","土木与交通工程学院",15,"土木工程",1,"1996.10","茂名");
EnDate(3115002345,"钱太多","土木与交通工程学院",15,"土木工程",2,"1996.9","珠海");
EnDate(3114006758,"陈伟霆","土木与交通工程学院",14,"交通工程",2,"1995.5","珠海");
EnDate(3216007111,"周星驰","土木与交通工程程学院",16,"交通工程",4,"1997.8","深圳");
EnDate(3214007111,"林青霞","土木与交通工程学院",14,"交通工程系",3,"1994.8","深圳");

EnDate(3214005555,"李四","自动化学院",14,"自动控制",2,"1995.8","湛江");
EnDate(3215005556,"吴亦凡","自动化学院",15,"电力工程",2,"1996.7","广州");
EnDate(3216005589,"张艺兴","自动化学院",16,"电力工程",3,"1997.5","茂名");
EnDate(3215004321,"鹿晗","自动化学院",15,"自动控制",4,"1996.8","湛江");

EnDate(3215006060,"赵五","计算机学院",15,"计算机科技",3,"1998.1","阳江");
EnDate(3216005059,"叶问","计算机学院",16,"软件工程",3,"1998.1","佛山");
EnDate(3214003838,"胡歌","计算机学院",14,"计算机科技",1,"1994.7","阳江");
EnDate(3216000303,"李浩","计算机学院",16,"软件工程",4,"1998.4","佛山");


EnDate(3215007878,"马晓","应用数学学院",15,"高等数学",4,"1996.5","佛山");
EnDate(3215008787,"李晨","应用数学学院",15,"应用数学",3,"1996.6","湛江");
EnDate(3216007878,"范冰冰","应用数学学院",16,"高等数学",2,"1997.5","广州");
EnDate(3214004532,"李冰冰","应用数学学院",14,"应用数学",4,"1994.7","阳江");


EnDate(3215009001,"邓超","材料与能源学院",15,"金属材料工程",1,"1996.2","清远");
EnDate(3214009067,"孙俪","材料与能源学院",14,"能源工程",2,"1994.2","清远");
EnDate(3216009001,"陈赫","材料与能源学院",16,"微电子材料与工程",3,"1997.2","增城");
EnDate(3215009001,"曾小贤","材料与能源学院",15,"能源工程",4,"1996.2","广州");


EnDate(3114007890,"王祖蓝","环境科学与工程学院",14,"环境工程",2,"1995.7","珠海");
EnDate(3115007652,"陈豪","环境科学与工程学院",15,"环境工程",1,"1996.5","深圳");
EnDate(3116005493,"钟嘉欣","环境科学与工程学院",16,"生物工程",3,"1997.3","广州");
EnDate(3116001156,"陈法拉","环境科学与工程学院",16,"生物工程",2,"1998.4","湛江");


EnDate(3115004567,"郑恺","外国语学院",14,"日语",3,"1995.8","韶关");
EnDate(3115001023,"倪妮","外国语学院",15,"商英",4,"1996.8","深圳");
EnDate(3116009067,"井柏然","外国语学院",16,"英语",2,"1997.8","中山");
EnDate(3114008484,"李连杰","外国语学院",14,"日语",1,"1995.8","韶关");
}
